### 데이터프레임
- 2차원 배열
- 2차원 벡터, 행렬
- 열 == 속성 == 항목
- 행 == 레코드 == 줄
- 예) 주식종목 행 - 관측값 열 - 종목코드,회사이름,액면가,총 주식수

In [16]:
# 데이터프레임 만들기
import pandas as pd
dict_data = {'c0':[1,2,3,] ,'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
df = pd.DataFrame(dict_data , index=['A','B','C'])
print(df)

   c0  c1  c2  c3  c4
A   1   4   7  10  13
B   2   5   8  11  14
C   3   6   9  12  15

In [6]:
# 데이터프레임 만들기
import pandas as pd
info_data = {'name':['Kim','Lee','Park'] ,'age':[24,27,34],'children':[2,1,3]}
inf = pd.DataFrame(info_data)
print(inf)

   name  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [25]:
# pd.DataFrame (2차원배열, index = 행 인덱스 배열, columns = 열 이름 배열)
d_2 = [[15,'남','구봉중'],[18,'여','봉우중']]
df2 = pd.DataFrame (d_2)
df2.index = ['1반','2반']
df2.columns = ['나이','성별','중학교명']
print(df2)
# rename
df2 = df2.rename(index={'1반':'준서','2반':'예은'})
df2 = df2.rename(columns={'중학교명':'학교'})
print(df2)
# drop '예은' 삭제하기 
df2 = df2.drop('예은', axis=0)
print(df2)
# drop '나이' 삭제하기 
df2 = df2.drop('나이', axis=1)
print(df2)

    나이 성별 중학교명
1반  15  남  구봉중
2반  18  여  봉우중
    나이 성별   학교
준서  15  남  구봉중
예은  18  여  봉우중
    나이 성별   학교
준서  15  남  구봉중
   성별   학교
준서  남  구봉중

In [48]:
# 예제 1-7)
exam_data = {'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df)
# DataFrame을 copy하여 변수 df2에 저장, df2의 1개 행 삭제
df2 = df.copy()
df2 = df2.drop('우현', axis=0)
print(df2)
# 우현,인아 둘 다 삭제
df3 = df.copy()
df3 = df3.drop(['우현','인아'], axis=0)
df3

    수학  영어   음악   체육
서준  90  97   95  100
우현  80  82   85   90
인아  70  95  100   90
    수학  영어   음악   체육
서준  90  97   95  100
인아  70  95  100   90

    수학  영어  음악   체육
서준  90  97  95  100

In [42]:
# 선택
exam_data = {'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])

label1 = df.loc['서준']
print(label1)

label2 = df.iloc[1]
print(label2)

수학     90
영어     97
음악     95
체육    100
Name: 서준, dtype: int64
수학    80
영어    82
음악    85
체육    90
Name: 우현, dtype: int64

In [7]:
# 데이터프레임 문제 1)
fastfood = {'food':['KFC','McDonald','schoolFood'],'price':[1000,2000,2500],'rating':[4.5,3.9,4.2]}
ff = pd.DataFrame(fastfood)
print()

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  schoolFood   2500     4.2

In [13]:
# 데이터프레임 문제 2)
fastfood = {'food':['KFC','McDonald','schoolFood'],'price':[1000,2000,2500],'rating':[4.5,3.9,4.2]}
ff = pd.DataFrame(fastfood)
print(ff[['food','rating']])

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  schoolFood     4.2

In [50]:
# 데이터프레임 문제 3)
fastfood = {'food':['KFC','McDonald','schoolFood'],'price':[1000,2000,2500],'rating':[4.5,3.9,4.2]}
ff = pd.DataFrame(fastfood)
ff = ff.rename(columns={'food':'place'})
print(ff)

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  schoolFood   2500     4.2

In [78]:
# 선택
exam_data = {'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])

label = df.loc[['서준','우현']]
position = df.iloc[[0,1]]
print(label)
print(position)
print('\n')
label1 = df.loc['서준':'우현']
position1 = df.iloc[0:1]
print(label1)
print(position1)
print('\n')
math = df['수학']
print(math)
print('\n')
english = df.영어
english

    수학  영어  음악   체육
서준  90  97  95  100
우현  80  82  85   90
    수학  영어  음악   체육
서준  90  97  95  100
우현  80  82  85   90


    수학  영어  음악   체육
서준  90  97  95  100
우현  80  82  85   90
    수학  영어  음악   체육
서준  90  97  95  100


서준    90
우현    80
인아    70
Name: 수학, dtype: int64

서준    97
우현    82
인아    95
Name: 영어, dtype: int64

In [75]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  97   95  100
1  우현  80  82   85   90
2  인아  70  95  100   90

In [79]:
exam_data = {'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])

mus_pys = df[['음악','체육']]
mus_pys

     음악   체육
서준   95  100
우현   85   90
인아  100   90

In [80]:
df.iloc[::]

    수학  영어   음악   체육
서준  90  97   95  100
우현  80  82   85   90
인아  70  95  100   90

In [81]:
df.iloc[1::]

    수학  영어   음악  체육
우현  80  82   85  90
인아  70  95  100  90

In [82]:
df.iloc[::-1]

    수학  영어   음악   체육
인아  70  95  100   90
우현  80  82   85   90
서준  90  97   95  100

In [84]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

print(df)
print('\n')
df = df.set_index('이름')
print(df)

   이름  수학  영어   음악   체육
0  서준  90  97   95  100
1  우현  80  82   85   90
2  인아  70  95  100   90


    수학  영어   음악   체육
이름
서준  90  97   95  100
우현  80  82   85   90
인아  70  95  100   90

In [86]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

df = df.set_index('이름')
df.loc['서준',['음악','체육']]

음악     95
체육    100
Name: 서준, dtype: int64

In [99]:
# 열 추가
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

df['국어'] = 80
df['과학'] = [80,75,90]

# 행 추가
df.loc[3] = ['지아',100,89,95,85,90,100]
df

   이름   수학  영어   음악   체육  국어   과학
0  서준   90  97   95  100  80   80
1  우현   80  82   85   90  80   75
2  인아   70  95  100   90  80   90
3  지아  100  89   95   85  90  100

In [109]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

# 행 추가
df.loc[3] = 0
df.loc[4] = ['동규',90,80,70,60]
df

   이름  수학  영어   음악   체육
0  서준  90  97   95  100
1  우현  80  82   85   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

In [122]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

# 행 추가
df.loc[3] = 0
df.loc[4] = ['동규',90,80,70,60]
df = df.set_index('이름')
df

    수학  영어   음악   체육
이름
서준  90  97   95  100
우현  80  82   85   90
인아  70  95  100   90
0    0   0    0    0
동규  90  80   70   60

In [123]:
# 원소값 변경
df.loc['서준',['음악','체육']] = 80
df

    수학  영어   음악  체육
이름
서준  90  97   80  80
우현  80  82   85  90
인아  70  95  100  90
0    0   0    0   0
동규  90  80   70  60